package com.example.a12_13.zhihui;

import androidx.appcompat.app.AppCompatActivity;

import android.os.Bundle;

import com.example.a12_13.R;

import java.util.ArrayList;
import java.util.List;

public class A_data extends AppCompatActivity {
    public static List<Integer> zh_img=new ArrayList<>();
    public static List<String> zh_title=new ArrayList<>();
    public static List<String> zh_count=new ArrayList<>();

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_a_data);
        initdata();
    }

    public static void initdata() {
        zh_img.add(R.drawable.zh1);
        zh_img.add(R.drawable.zh2);
        zh_img.add(R.drawable.zh3);
        zh_img.add(R.drawable.zh4);
        zh_title.add("同辉养老");
        zh_title.add("佳林养老院");
        zh_title.add("河北枫叶老年公寓");
        zh_title.add("石家庄藁城区盛德老年公寓");
        zh_count.add("同辉养老（集团）是一家有梦想、有强烈社会责任感的医养健康服务型企业，定位于一家连锁化的医养结合型中高端养老服务品牌。我们坚持以“同辉医养，让长者生命更健康”的根本服务宗旨，以打造“中国一流医养服务品牌”为发展愿景，以“代忙碌儿女尽孝，替孤独父母解愁，为党和政府分忧”为己任，致力于“提供高品质、专业化的医养健康服务，履行社会责任”的企业使命，为离退休长者提供无微不至的“医养康护娱居”一站式服务，像爱自己的孩子一样爱长者，替天下忙碌儿女尽一份爱心，为国家社会贡献一份责任。\n" +
                " \n" +
                "人人会变老，家家有老人。同辉养老（集团）崇尚的是天底下最崇高的为老服务事业。做人做事成功的关键，就是从构建长者健康美好幸福新生活开始；服务长者，服务老人，就是在创造美好幸福生活！\n" +
                "立足重庆主城以夯实基础，逐步拓展构建覆盖全市的服务网络。近期以机构养老为主体，配套建设市级、区级社区养老服务中心，利用杰佳通智慧养老平台为核心平台，连锁开展居家养老服务，适时承接公建民营项目，逐步开办养老职业培训、养老专业咨询服务等业务，逐步实现机构养老社区化、社区养老专业化、连锁养老品质化发展目标。\n");
        zh_count.add("佳林养老院设计合理,环境优美、空气新鲜.院内设有绿色休闲长廊、绿树成荫,四季常青.同时为满足住院老人的绿色饮食和业余生活,规划了休闲养殖园等。同时根据入住老人需要配置多媒体教室、图书阅览室、康复健身室、文化娱乐室等活动场所,确保入住老人业余生活丰富多彩、颐养天年。\n" +
                " \n" +
                "  \n" +
                "1. 对三环内老人入住免费车接。\n" +
                "2. 残疾老人、无儿女老人、智障人员入住,享受相应优惠政策。\n" +
                "3. 入住老人可按公寓管理规定,分得一块田地用于自主种植。\n" +
                "4. 为老人建立健康档案,配备专业资格医师进行诊断,护理人员持认证资格上岗。\n" +
                "5. 全护专区的设立,不止为老人提供及时、便利 、精准的医疗服务,并将生活\n" +
                "6. 照料与身体康复相结合。\n" +
                "7. 专业厨师根据季节及老人身体情况进行营养配餐。\n");
        zh_count.add("长安区枫叶老年公寓位于动力医院三、四楼,是集医疗、护理、托管、娱乐、康复为一体的大型医疗养老机构,老年公寓将养老和医疗完美结合,让入住的老人在养老的同时加上一份及时的医疗保障。\n" +
                " \n" +
                " \n" +
                "1. 医保定点单位。\n" +
                "2. 建立健康档案，医生随时査诊。\n" +
                "3. 全方位提供专业的医疗支持。\n" +
                "4. 可为入住老人提供针灸、按摩、康复等特色理疗服务，使老人可以足不出户得到方便就医。\n");
        zh_count.add("藁城区盛德老年公寓依据生态养老标准,以园林建筑风格为特色,根据老年人对亲近生态环境,享受自然环境的生活和养生需求开设园林观赏区、休闲区、健身区、种植区等多个特色小园区,让老年人充分融入春天赏花、夏天收菜、秋天摘果、冬天观景的四季风光中.是一家集养老、照护、医疗、康复、文化、娱乐为一体的亲情化老年公寓。\n" +
                " \n" +
                " \n" +
                "特色服务\n" +
                "1. 对藁城市区及周边地区老人入住免费车接\n" +
                "2. 残疾老人、无儿女老人、智障人员入住,享受相应优惠政策\n" +
                "3. 为老人建立健康档案，配备专业资格医生进行诊断，护理人员持证上岗\n" +
                "4. 专业厨师根据季节及老人身体情况进行营养配餐\n");




    }
}